import React, { Component, Fragment } from 'react';
import ReactTooltip from 'react-tooltip';

export default class AboutUs extends Component {
    static displayName = AboutUs.name;

    render() {
        // تایتل صفحه
        document.getElementsByTagName("title")[0].innerHTML = `تتا اسپرت | درباره ما`;
        return (
            <Fragment>
                <ReactTooltip place="top" type="dark" effect="solid" />
                <div className={`${localStorage.getItem('theme') === 'dark' ? 'static-container--dark' : 'static-container'}`}>
                    <h1 className='terms-h1'>درباره ما</h1>
                    <h3 className='terms-h3'>به وبسایت تتا اسپورت خوش آمدید</h3>
                    <p className='terms-txt'>
تتا اسپورت،پلتفرمی برای برگزار کردن لیگ در دو رشته فوتبال و فوتسال برای تمام کسانی که در حوزه‌ی برگزاری لیگ فعالیت دارند، همچنین تمام سازمانها و ارگانهایی که میخواهند لیگ برگزار کنند میباشد.<br/>
                        بدون شک برگزاری یک لیگ در حد متوسط هم کار ساده‌ای نیست که نیاز به زیر‌ساخت مناسب و هماهنگی‌های زیادی بین برگزارکننده و شرکت کنندگان دارد.<br />
                        بخشی از مشکلات عمده‌ای که در تتااسپورت قابل حل شدن هستند عبارتند از:<br />
                        •	جذب شرکت‌کننده برای مسابقه<br />
                        •	ثبت‌نام آنلاین شرکت‌کنندگان<br />
                        •	اعطای جوایز به نفرات برتر<br />
                        •	ثبت نتایج همه بازیها<br />
                        •	ثبت عکس ها و فیلم های مهم و شورانگیز و اشتراک گذاری آن<br />
                        •	اطلاع از دوستان خود در مسابقات مختلف<br />
                        ما برای تسهیل برگزاری لیگ در هر بازی با امنیت بالا این پلتفرم را برای شما علاقه‌مندان به ورزش‌ طراحی کردیم. <br />
                        شما می‌توانید مسابقه‌ای را با شرایط خود و با ساختارهای متنوع ایجاد نمایید. <br />
                        همچنین این پلتفرم فضایی برای کسب درآمد شما بازیکنان و برگزارکنندگان ایجاد کرده است.<br />
                        اطلاعات مربوط به لیگی که برگزار می‌کنید را در تتااسپورت در معرض دید دیگران قرار دهید.
چه برگزارکننده‌ی مسابقات باشید و چه بخواهید در یکی از لیگ ها شرکت کنید، شما عضوی از خانواده‌ی بزرگ تتا اسپورت هستید و نظرات شما ما را در جهت رسیدن به اهدافتان یاری خواهد کرد. <br />
                        برای کسب اطلاعات بیش‌تر و انتقال نظرتان، با ما تماس بگیرید.                                       
                    </p>
                </div>
            </Fragment>
        );
    }
}